1. Create a pandas data frame d1 with following data

In [1]:
import pandas as pd
data = {'one':[0,4,8],'two':[1,5,9],'three':[2,6,10],'four':[3,7,11]}
df=pd.DataFrame(data,index=['Ohio','Colorado','New York'])
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

2. Add two columns namely duplicate1, duplicate1 with data frame in question 1 and values to
Columns using pandas series.

In [2]:
df['duplicate 1']=pd.Series([7,8,9],index=['Ohio','Colorado','New York'])
df['duplicate 2']=pd.Series([1,5,13],index=['Ohio','Colorado','New York'])
df

          one  two  three  four  duplicate 1  duplicate 2
Ohio        0    1      2     3            7            1
Colorado    4    5      6     7            8            5
New York    8    9     10    11            9           13

3.Drop New York row from the data frame obtained in the question 2 and store the result in DF3
  And display.

In [3]:
DF3= df.drop('New York',axis=0)
DF3

          one  two  three  four  duplicate 1  duplicate 2
Ohio        0    1      2     3            7            1
Colorado    4    5      6     7            8            5

4.Create a pandas series with values 0-9 and provide the indexes one, two, threeâ€¦..nine.

In [4]:
d=pd.Series([0,1,2,3,4,5,6,7,8],index=['one','two','three','four','five','six','seven','eight','nine'])
d

one      0
two      1
three    2
four     3
five     4
six      5
seven    6
eight    7
nine     8
dtype: int64

5.Perform division operation between data frame obtained in question 1 and pandas series
Obtained in question 4 and store the result in another variable.

In [5]:
div=df/d
div

,duplicate 1,duplicate 2,eight,five,four,nine,one,seven,six,three,two
Ohio,NaN,NaN,NaN,NaN,1.000000,NaN,NaN,NaN,NaN,1.0,1.0
Colorado,NaN,NaN,NaN,NaN,2.333333,NaN,inf,NaN,NaN,3.0,5.0
New York,NaN,NaN,NaN,NaN,3.666667,NaN,inf,NaN,NaN,5.0,9.0

6.Create  NaN value with DataFrame question 1,check if a DataFrame d1 has may missing value, to replace NaNs with a single constant value in specified columns in a DataFrame.

In [6]:
df['duplicate 3']=pd.Series([14,55,48])
df['duplicate 3'] = df['duplicate 3'].fillna(4)
df

          one  two  three  four  duplicate 1  duplicate 2  duplicate 3
Ohio        0    1      2     3            7            1          4.0
Colorado    4    5      6     7            8            5          4.0
New York    8    9     10    11            9           13          4.0

7. Creating a series containing two arrays of indexes (i.e., creating a structure with two levels) and swap two level.

In [7]:
lst = ['one,two,three,four,five,six,seven,eight'.split(',')]
arrays = [[range(1,5)],[range(5,9)]]
s = pd.Series(lst, index=arrays)
s.unstack()

                                                  (5, 6, 7, 8)
(1, 2, 3, 4)  [one, two, three, four, five, six, seven, eight]

8.With data frame Question 1 convert into series.

In [8]:
a = df.apply(pd.Series).stack().reset_index(drop=True)
a

0      0.0
1      1.0
2      2.0
3      3.0
4      7.0
5      1.0
6      4.0
7      4.0
8      5.0
9      6.0
10     7.0
11     8.0
12     5.0
13     4.0
14     8.0
15     9.0
16    10.0
17    11.0
18     9.0
19    13.0
20     4.0
dtype: float64